[
  "GlobalTech World Professionals Limited (trading as Globaltech) is a formally registered IT services and training provider with 24 years of experience. Incorporated in Nigeria in 2005 (CAC). Corporate member of Computer Professional Registration Council of Nigeria (CPN License 006548/2020) and Nigeria Computer Society (NCS Reg 14937). Approved by Lagos State Ministry of Education (MED/PESP/VOC.4/2007/0077/VOL.I/128). Also registered in Republic of South Africa and Ghana.",
  "Mission: To offer the finest quality tech consulting services and education, constantly updated to the changing IT landscape. Vision: To be among the top ICT consultant and training providers in the world. Core values: Professionalism, Transparency, Accountability, Efficiency. Social‑impact values: developing applications for clients/society, cybersecurity‑awareness creation, partnering with government/companies to deliver ICT services to underserved communities.",
  "Operates through six service hubs: Cloud Services, Training Institute, Cybersecurity Hub, IT Support Hub, Software Hub, MobileApps Desk. Four main business pillars: IT Consultancy, Technical Support, Tech Career Training (primary focus), Software Deployment & Security. Additional activities: app development, cybersecurity awareness, partnerships with government agencies and companies.",
  "Website features over 30 career‑oriented technology courses. Universal 30% discount shown as strikethrough pricing. Dual‑currency pricing (Nigerian Naira ₦ and US Dollars $). Every course includes a FREE LAPTOP promotion. Implied exchange rate: ~₦1,665 to $1.",
  "Cybersecurity & Ethical Hacking: Full‑Stack Cybersecurity, CEHv13, OSCP, CPENT, CHFI/Forensic. Price range: ₦245,000 – ₦7,525,000. Includes IT Support certifications; highest‑priced course. Web & Software Development: Full‑Stack Web Dev, FrontEnd, Mobile App, WordPress, Software Engineering. Price range: ₦420,000 – ₦5,250,000. Some labeled \"Career Enabler\".",
  "Networking & Infrastructure: CCNA, CCNP, CompTIA A+/Net+/Security+, Network Administrator. Price range: ₦175,000 – ₦752,500. Foundation IT skills. Data Science & Analytics: Master in Data Science, AI & Machine Learning, Data Analytics, Business Intelligence. Price range: ₦595,000 – ₦1,680,000. Includes Python for Data Science.",
  "Programming & Databases: Python Programming, Java for Android, Oracle DB Admin. Price range: ₦455,000 – ₦595,000. Multiple Python course levels. Digital Skills: Digital Marketing, Graphic Design, UI/UX, SEO, Social Media Marketing. Price range: ₦266,000 – ₦595,000. Practical business skills.",
  "Most expensive course: \"Full‑Stack Cybersecurity Earn Global Certification & University Diploma Certificate\" (₦7,525,000 / $4,525.99). Budget entry: \"ICT Fundamentals ‑ Microsoft Specialist\" (₦175,000 / $124.79). University diplomas offered in some high‑end courses. Many courses labeled \"Career Enabler\". Price clusters: Entry‑level (₦175k‑₦455k), Mid‑range (₦490k‑₦1.05M), Premium (₦1.4M‑₦7.525M).",
  "Unique selling propositions: 1) FREE LAPTOP with every course, 2) Courses aligned with global certifications (CompTIA, Cisco, CEH), 3) Career‑transition focus with practical skills, 4) Dual audience (Nigerian and foreign applicants). Business positioning: bridges Education (individual skill development), Enterprise services (IT consultancy/development), and Social impact (cybersecurity awareness, community ICT delivery). Website functions as a course catalog and lead‑generation tool.",
  "Certified Professional Service Organization (PSO) for Federal Government MDAs on digitalization (certified by Galaxy Backbone). Approved Facilitator for NYSC Skill Acquisition and Entrepreneurship Development (SAED) program. Holds compliance certificates from Industrial Training Fund (ITF), National Pension Commission (PENCOM), Nigeria Social Insurance Trust Fund (NSITF), and Bureau of Public Procurement (BPP).",
  "Founder: Dr. C.itp. Asogbon Oluwayomi Godwin, PhD. Titles: Director/Founder, President/CEO. Qualifications: PhD in IT/Cybersecurity (European American University), D.Sc. in Leadership and Corporate Governance, Master of IT, LL.B Hons, B.Sc. Computer Science. Certifications: Certified Ethical Hacker (CEH ECC4062715983), Certified Management Consultant (CMC), Certified Secure Computer User (CSCU), many others.",
  "Roles: IT Expert, Ethical Hacker, Forensic Investigator, Legal Adviser, Cybersecurity Arbitrator, Researcher, Inspirational Speaker, ECMS Implementation Consultant for Federal Government MDAs, Cyber‑diplomat, Capacity Builder, Humanitarian, Word of Faith Preacher. Over two decades of teaching professional IT courses (CCNA, Windows Server, CEH, CHFI, CPENT, OSCP, CISSP, GDPR, GRC, AI Security, Blockchain Security, Web Design, Software Engineering, Oracle, SAP, Sage, Peachtree).",
  "Chartered IT Practitioner of Nigeria (C.itp). Member: Computer Professional Registration Council of Nigeria (CPN Reg 2019/005917), Nigeria Computer Society (NCS Reg 14893). Appointed International Cybersecurity Mentor by EC‑Council USA. Fellow & Certified Management Consultant of Institute of Management Consultants of Nigeria (FIMC.LAG.3502.23, CMC.LAG.3704.23). Associate Member of Nigerian Chartered Institute of Arbitrators (NCA 005667). Ambassador for International Association of World Peace Advocates (UNPV). Certificate in SAP.",
  "Market focus: Strong emphasis on Nigerian market with international options. Competitive strategy: Bundle approach (course + laptop + certification preparation). Scope: Wide range from beginner to advanced professional levels. Revenue model: Likely mix of course fees and corporate IT service contracts. Technology expertise: mobile/web‑based software development, API integration, cloud computing, cybersecurity, data analytics. Offers \"Hire a Developer\" service."
]